importing pandas as pd

In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'yes':[50,21],'no':[131,2]})

   yes   no
0   50  131
1   21    2

In [3]:
Dataset=pd.read_csv("Data.csv")

In [4]:
Dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
Dataset.shape

(10, 4)

In [6]:
Dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [7]:
Dataset['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [8]:
Dataset['Country'][4]

'Germany'

In [9]:
Dataset['Country'][5:9]

5     France
6      Spain
7     France
8    Germany
Name: Country, dtype: object

In [10]:
Dataset.Country == 'Germany'

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8     True
9    False
Name: Country, dtype: bool

In [11]:
Dataset.loc[Dataset.Country == "Germany"]

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [12]:
Germany_Column=Dataset.loc[Dataset.Country == "Germany"]

In [13]:
Germany_Column

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [14]:
Germany_Column.to_csv('germanydata.csv')

In [15]:
Dataset.loc[Dataset.Salary.notnull()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [16]:
Dataset.loc[Dataset.Salary.isnull()]

   Country   Age  Salary Purchased
4  Germany  40.0     NaN       Yes

In [19]:
#Assigning salary to a specific column
Dataset['Salary'] = 10000

In [20]:
Dataset

   Country   Age  Salary Purchased
0   France  44.0   10000        No
1    Spain  27.0   10000       Yes
2  Germany  30.0   10000        No
3    Spain  38.0   10000        No
4  Germany  40.0   10000       Yes
5   France  35.0   10000       Yes
6    Spain   NaN   10000        No
7   France  48.0   10000       Yes
8  Germany  50.0   10000        No
9   France  37.0   10000       Yes

In [21]:
#Assigning the value to a specific row
Dataset.loc[2, 'Salary'] = 250000

In [22]:
Dataset

   Country   Age  Salary Purchased
0   France  44.0   10000        No
1    Spain  27.0   10000       Yes
2  Germany  30.0  250000        No
3    Spain  38.0   10000        No
4  Germany  40.0   10000       Yes
5   France  35.0   10000       Yes
6    Spain   NaN   10000        No
7   France  48.0   10000       Yes
8  Germany  50.0   10000        No
9   France  37.0   10000       Yes

In [23]:
Dataset.Salary.describe()

count        10.000000
mean      34000.000000
std       75894.663844
min       10000.000000
25%       10000.000000
50%       10000.000000
75%       10000.000000
max      250000.000000
Name: Salary, dtype: float64

In [24]:
Dataset.Salary.unique()

array([ 10000, 250000], dtype=int64)

In [25]:
Dataset.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [26]:
Dataset.Salary.value_counts()

10000     9
250000    1
Name: Salary, dtype: int64

In [27]:
Dataset.Salary.dtype

dtype('int64')

In [28]:
Dataset.dtypes

Country       object
Age          float64
Salary         int64
Purchased     object
dtype: object